#============================
# Taps
#============================

tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "mhaeuser/mhaeuser"

#============================
# Brews
#============================

brew "colima"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "docker-credential-helper"
brew "neovim"
brew "lazygit"
brew "lua"
brew "openjdk"
brew "uv"
brew "fnm"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "ripgrep"
brew "mas"
brew "stow"
brew "tmux"
brew "borders"

#============================
# Casks
#============================

cask "visual-studio-code"
cask "bruno"
cask "dbeaver-community"
cask "ghostty"
cask "kitty"
cask "aerospace"
cask "keka"
cask "betterdisplay"
cask "balenaetcher"
cask "sf-symbols"
cask "battery-toolkit"
cask "scroll-reverse"
cask "basictex"
cask "obsidian"
cask "firefox"
cask "google-chrome"
cask "gimp"
cask "handbrake-app"
cask "losslesscut"
cask "vlc"
cask "spotifiy"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-roboto"

#============================
# App Store Apps
#============================

mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NordPass® Password Manager & Digital Vault", id: 6443917910
mas "Surfshark", id: 1437809329
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
